hurrican/ak-hurrican-gui/test/resources/de/augustakom/common/tools/xml/wita/valid-tal-neu.xml

<?xml version="1.0" encoding="utf-8" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-100">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-101">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>SK9CEBe3oVZH/q9AhrY+zSxE9DQ=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
h/+hGWlV4fm8Pwp9DbHn2bsdF61E+GIGwyA1qF6yp3U+Wv2UkSYeCKX3OTIwoCh7+GKt2eFBCvmR
8rlnG8b1dQOkorLQJftyHM24n1LHzdxXo8SYf9jHuS6sXY9cz0BQXjOWtCK5WnzYc1tgB9CFMf17
5uzvZCcrTmA12W2NEUOEhUDFjzvVXUSHgksBw2tSnoXTJ+zyjAH6CHOjsHCQv3s7nwWjgctzVCi+
80xTzeL0bD8+eknP9oCOZrUc5j3fVfizp/igogNSHTTTyiRTsKWtHjvKdsqtHilk7rGzolChzjzt
Xb0fGcVI57leTjJrteYUtk3DesRAW5fwgKuOXQ==
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-6A79B7E229F723E8251315468390889110">
<wsse:SecurityTokenReference xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-6A79B7E229F723E8251315468390889111" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:X509Data>
<ds:X509IssuerSerial>
<ds:X509IssuerName>CN=mnet</ds:X509IssuerName>
<ds:X509SerialNumber>1312200651</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-101"><ns3:annehmenAuftragRequest xmlns:ns3="http://wholesale.telekom.de/oss/v4/envelope" xmlns=""><control><zeitstempel>2011-09-08T09:53:10.889+02:00</zeitstempel><majorRelease>4</majorRelease><minorRelease>00</minorRelease><signaturId><issuer>EMAILADDRESS=wita@m-net.de, CN=wita, OU=IT, O=M-net Telekommunikations GmbH, L=Munich, ST=Bavaria, C=DE</issuer><serial>fc21b78feb81ebf3</serial></signaturId></control><auftrag><externeAuftragsnummer>0200001929</externeAuftragsnummer><kunde><kundennummer>5920314090</kundennummer><leistungsnummer>0000004488</leistungsnummer></kunde><besteller><kundennummer>5920312290</kundennummer><leistungsnummer>0000004364</leistungsnummer></besteller><geschaeftsfall xmlns:ns5="http://wholesale.telekom.de/oss/v4/order" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns5:BereitstellungType"><BKTOFaktura>5883000391</BKTOFaktura><ansprechpartner><auftragsmanagement><anrede>9</anrede><vorname>TestFirstName</vorname><nachname>TAL_Bereit_Neu_21</nachname><telefonnummer>089 0000000</telefonnummer><emailadresse>hurrican_developer@m-net.de</emailadresse></auftragsmanagement></ansprechpartner><termine><kundenwunschtermin><datum>2011-09-22</datum><zeitfenster>2</zeitfenster></kundenwunschtermin></termine><auftragsposition><produkt xmlns:ns6="http://wholesale.telekom.de/oss/v4/tal" xsi:type="ns6:ProduktTALType"><bezeichner>TAL; CuDA 2 Draht hbr (HVt)</bezeichner></produkt><geschaeftsfallProdukt xmlns:ns6="http://wholesale.telekom.de/oss/v4/tal" xsi:type="ns6:TALBereitstellungType"><standortA><person><anrede>1</anrede><vorname>Max</vorname><nachname>Mustermann</nachname></person><strasse><strassenname>Mitteldeichstr.</strassenname><hausnummer>8</hausnummer><hausnummernZusatz>a</hausnummernZusatz></strasse><land>de</land><postleitzahl>26919</postleitzahl><ort><ortsname>Brake</ortsname><ortsteil>a.d.XYZ</ortsteil></ort><lageTAEDose>Keller</lageTAEDose></standortA><standortB><strasse><strassenname>Georgstr.</strassenname><hausnummer>1</hausnummer><hausnummernZusatz>a</hausnummernZusatz></strasse><postleitzahl>26919</postleitzahl><ort><ortsname>Brake</ortsname><ortsteil>zusatz</ortsteil></ort><lageKollokationsraum><ONKZ>4401</ONKZ><anschlussbereich>1</anschlussbereich></lageKollokationsraum></standortB><montageleistung><ansprechpartner><anrede>9</anrede><vorname>Montage</vorname><nachname>Wita</nachname><telefonnummer>0821 532324</telefonnummer><emailadresse>hurrican_developer@m-net.de</emailadresse></ansprechpartner></montageleistung><uebertragungsverfahren>H04</uebertragungsverfahren><schaltangaben><schaltung xmlns:ns7="http://wholesale.telekom.de/oss/v4/complex" xsi:type="ns7:SchaltungKupferType"><UEVT>1PH1</UEVT><EVS>01</EVS><doppelader>01</doppelader></schaltung></schaltangaben></geschaeftsfallProdukt></auftragsposition></geschaeftsfall></auftrag></ns3:annehmenAuftragRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>